Revit 2025 API
GBXMLExportOptions.GetMassIds Method
 Gets a list of masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public IList<ElementId> GetMassIds()
Public Function GetMassIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetMassIds()
member GetMassIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The ids of the masses.
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace